---
title: DirectContext3DHandleOverrides
classe: Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleOverrides
namespace: Autodesk.Revit.DB.DirectContext3D
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# DirectContext3DHandleOverrides

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `directContext3DHandleOverrides.IsValidObject` | Boolean |
| `Void Assign(DirectContext3DHandleOverrides)` | `directContext3DHandleOverrides.Assign(other)` | Void |
| `Void Dispose()` | `directContext3DHandleOverrides.Dispose()` | Void |
| `DirectContext3DHandleSettings GetDirectContext3DHandleSettings(Document, ElementId)` | `directContext3DHandleOverrides.GetDirectContext3DHandleSettings(aDoc, elementId)` | DirectContext3DHandleSettings |
| `Boolean IsEqual(DirectContext3DHandleOverrides)` | `directContext3DHandleOverrides.IsEqual(other)` | Boolean |
| `Void SetDirectContext3DHandleSettings(Document, ElementId, DirectContext3DHandleSettings)` | `directContext3DHandleOverrides.SetDirectContext3DHandleSettings(aDoc, elementId, newSettings)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```